{
  "navbar": {
    "home": "Inicio",
    "about": "Sobre mi",
    "projects": "Proyectos",
    "services": "Servicios",
    "contact": "Contacto"
  },
  "landing": {
    "title": "Hola!",
    "subtitle": "Soy Joaquín Gómez",
    "description": "Desarrollador Fullstack",
    "button": "Ver Proyectos"
  },
  "about": {
    "subheader": "Introducción",
    "header": "Sobre mi",
    "firstParagraph": "Soy desarollador web con experiencia trabajando tanto en el frontend, como en el backend. Me especializo en crear aplicaciones robustas y puedo trabajar tanto en el código del lado del cliente como del servidor. Actualmente cuento con experiencia creando aplicaciones web con Typescript, React, NodeJs, Express, SQL, TailwindCss. También cuento con experiencia en desarrollo móvil utilizando frameworks híbridos, como lo son Flutter y React Native",
    "secondParagraph": "Desde muy chico me encantaba la idea de ser capaz de crear aplicaciones que puedan ayudar, entretener y ser súmamente útiles para el resto del mundo. Hoy puedo decir con mucho orgullo que, gracias a mi esfuerzo y el aporte de la comunidad de desarrolladores, puedo estar cumpliendo mi sueño",
    "thirdParagraph": "Si estás buscando un desarrollador, apasionado, energético, con pensamiento crítico, autodidácta, en constante capacitación, con atención al detalle y con muchas ganas de trabajar en lo que le apasiona, no dudes en ponerte en contacto conmigo utilizando mis ",
    "url": "links de contacto",
    "technologies": {
      "title": "Tecnologías",
      "js": "JavaScript / Typescript",
      "react": "React",
      "node": "Nodejs usando Express y Nestjs",
      "db": "MongoDB / SQL",
      "misc": "Patrones de diseño y arquitectura",
      "git": "Git"
    }
  },
  "projects": {
    "header": "showcase",
    "title": "Algunos de mis proyectos",
    "viewSourceCode": "Ver código fuente",
    "viewDemo": "Ver demo",
    "projects": {
      "bugtracker": {
        "title": "Bugtracker",
        "paragraphs": {
          "1": "Aplicación para el seguimiento y correción de errores dentro de un proyecto",
          "2": "Esta aplicación permite al usuario crear y compartir proyectos de distinto tipo. Cuenta con un sistema de autorización que permite a los usuarios gestionar sus proyectos de manera segura, garantizando que solamente tendrá acceso a dicho proyecto aquellos usuarios que sean parte del mismo",
          "3": "Además cuenta con un sistema de informe de errores que permite seguir de forma mas organizada cuales son los problemas que van surgiendo a lo largo del desarrollo de cada proyecto. Asi también como una casilla de comentarios dentro de cada informe para poder mantener discusiones sobre cual seria el mejor plan de acción para resolverlo"
        },
        "sideNote": "*Nota: Si querés entrar a revisar un poco más y no querés crearte una cuenta, podes usar las siguientes credenciales que dejo a modo de prueba:"
      },
      "twitterUi": {
        "title": "Twitter UI - Maquetado en React",
        "paragraphs": {
          "1": "Proyecto de maquetado utilizando React y TailwindCss. El objetivo de este proyecto es demostrar mis habilidades de maquetado y mi capacidad de trabajar con un diseño pre-definido. Esta aplicación cuenta únicamente con lógica del lado del cliente, es decir toda la persistencia que maneja este proyecto es de manera local"
        }
      },
      "ecommerce": {
        "title": "Electroniks E-commerce",
        "paragraphs": {
          "1": "Aplicacion de comercio electrónico en la cual implemento funcionalidad de carro de compras, enrutamiento dinámico, autorización y autenticación de usuarios, productos favoritos y funcionalidad de CRUD para usuarios administradores.",
          "2": "Lamentablemente esta aplicación fue desarrollada únicamente con propósitos educativos y no cuenta con ningún tipo de logística real detrás de su funcionalidad, por lo cual no implementé un sistema de cobro y procesamiento de pagos (Como podría haber hecho con la API de Stripe o MercadoPago) para evitar confusiones en el caso de que alguien intente hacer una compra utilizando una tarjeta de crédito válida. Tecnologías utilizadas:"
        },
        "sideNote": "Todas las animaciones están hechas con css unicamente"
      },
      "pokepedia": {
        "title": "Pokepedia",
        "paragraphs": {
          "1": "Seguramente viste este tipo de aplicaciones de pokemon o similares un montón de veces, y hasta puede que pienses que no demuestra mucha profesionalidad. Pero me parece súper importante incluirlo en mi portafolio ya que demuestra de forma simple, e interactiva que puedo trabajar con operaciones asíncronas y obtener datos de un servidor sin ningún problema",
          "2": "Este fue el primer proyecto que realicé utilizando React y a pesar de que por ahí es un proyecto considerado como 'poco serio', le tengo mucho aprecio ya que me permitió aprender muchos de los conceptos que hoy manejo a diario con este fantástico framework"
        },
        "thirdParagraph": "La principal funcionalidad de esta aplicación es brindar a quienes lo necesiten información sobre los juegos publicados de la saga Pokemon."
      },
      "proof": {
        "title": "Proof - Maquetado HTML CSS",
        "paragraphs": {
          "1": "Este es uno de las primeras páginas en las que trabajé, es solamente un landing page hecho sin ningún framework",
          "2": "Es una recreación del landing page de una compañia llamada proof, cuyo sitio original se puede encontrar al hacer click al logo de la empresa"
        }
      }
    }
  },
  "services": {
    "title": "Mis Servicios",
    "service1": {
      "title": "Amplia experiencia en React",
      "description": "Basto conocimiento en cómo funciona el framework mas utilizado actualmente. Entiendo de forma amplia como funciona el renderizado en tiempo real, como funciona el ciclo de vida de un componente y como integrar una aplicación a diversos entornos que puedan tener en tu empresa"
    },
    "service2": {
      "title": "Responsive web design",
      "description": "Creación de layouts dinámicas que adaptan de manera elegante el diseño de cualquier sitio web"
    },
    "service3": {
      "title": "English proficiency",
      "description": "I believe being able to communicate in fluent English is one of the most important skills to have in order to be an awesome Software Developer"
    },
    "service4": {
      "title": "Frontend y Backend",
      "description": "Cuento con experiencia creando aplicaciones que interactúan tanto con el servidor y su base de datos como con el usuario y sus necesidades"
    },
    "service5": {
      "title": "Resolución de problemas",
      "description": "Pensamiento lógico y habilidades de analisis para resolver los diferentes desafíos que se presentan día a día"
    },
    "service6": {
      "title": "Team Player",
      "description": "Uno de los motivos por los que elegí esta carrera es por la posibilidad de trabajar con muchas personas de distintos ámbitos, por lo que cuento con excelentes capacidades de comunicación y trabajo en equipo. Me encanta tener la oportunidad de trabajar en equipo y aprender de los demás"
    }
  },
  "contact": {
    "header": "Información",
    "title": "Cómo Contactarme",
    "description": "Dejame un mensaje",
    "inputfield1": {
      "label": "Asunto",
      "placeholder": "Asunto"
    },
    "inputfield2": {
      "label": "Tu mensaje",
      "placeholder": "Contratado"
    },
    "button": "Enviar",
    "location": "Ubicación"
  }
}
